batch-stress.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>batch stress</title>
<!-- 2014-01-23 Thu 17:00 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Zhang Bin-jie" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content">
<h1 class="title">batch stress</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a>
<ul>
<li><a href="#sec-1-1">1.1. Requirement</a></li>
<li><a href="#sec-1-2">1.2. Test items</a></li>
<li><a href="#sec-1-3">1.3. Plan</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Install PXE server</a>
<ul>
<li><a href="#sec-2-1">2.1. Mount ISO</a></li>
<li><a href="#sec-2-2">2.2. Install OS</a></li>
<li><a href="#sec-2-3">2.3. Setup PXE server</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Install OS for SUTs via PXE</a></li>
<li><a href="#sec-4">4. Prepare before test</a>
<ul>
<li><a href="#sec-4-1">4.1. PXE server</a></li>
<li><a href="#sec-4-2">4.2. SUT</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Run stress</a>
<ul>
<li><a href="#sec-5-1">5.1. Run performance</a></li>
<li><a href="#sec-5-2">5.2. Run stress</a></li>
<li><a href="#sec-5-3">5.3. Run performance again</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Run DC</a>
<ul>
<li><a href="#sec-6-1">6.1. Start DC</a></li>
<li><a href="#sec-6-2">6.2. Stop DC</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Run reboot</a>
<ul>
<li><a href="#sec-7-1">7.1. Start reboot</a></li>
<li><a href="#sec-7-2">7.2. Stop reboot</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Requirement</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>All tests listed below must be ran for all SUTs (more than 50)<br  />
</li>
<li>All tests must collect logs and check failure<br  />
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Test items</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>Install OS<br  />
</li>
<li>Run performance before stress<br  />
</li>
<li>Run stress<br  />
</li>
<li>Run performance after stress<br  />
</li>
<li>Run DC<br  />
</li>
<li>Run reboot<br  />
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Plan</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>Install PXE server in one of the SUTs<br  />
</li>
<li>Install OS for all other SUTs with this PXE server<br  />
</li>
<li>Install pssh in the PXE server and control other SUTs<br  />
</li>
<li>Make a nfs share folder in the PXE server and copy all tools and scripts to this folder<br  />
</li>
<li>All SUTs(including the PXE server) mount this share folder<br  />
</li>
<li>All SUTs run scripts from the share folder and make sure the logs are stored in the sub folder named by SN in the share folder<br  />
</li>
<li>Add a check in DC/reboot script: if download a stop file from a ftp server (a notebook other than any SUT) successfully, stop, otherwise, continue<br  />
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Install PXE server</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Mount ISO</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Boot to BIOS setup. Config BMC network: static, 192.168.0.100, 255.255.255.0<br  />
</li>
<li>Config your notebook network: static, 192.168.0.10, 255.255.255.0<br  />
</li>
<li>Open IE and goto 192.168.0.100. Login with admin/admin. Click "Console"<br  />
</li>
<li>Click the DVD icon. Click "broswer&#x2026;" after DVD. Select rhel 5.7 iso. Click "connect"<br  />
</li>
<li>Reboot SUT and boot from this DVD device<br  />
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Install OS</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>Install OS with the virtual DVD<br  />
</li>
<li>Install pssh rpm<br  />
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Setup PXE server</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li>Config DHCP server<br  />
</li>
<li>Config tftp server<br  />
</li>
<li>Config nfs server<br  />
</li>
<li>Copy iso and mount<br  />
</li>
<li>Edit ks file<br  />
</li>
<li>Config BMC IP source back to DHCP if the default is DHCP<br  />
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Install OS for SUTs via PXE</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Scan BMC IP and save to bmc.ip.log<br  />
</li>
<li>Send IPMI commands to each BMC IP to set boot devic to PXE and reboot:<br  />
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #76c763;">for</span> i<span style="color: #76c763;"> in</span> $(cat bmc.ip.log);<span style="color: #76c763;">do</span>
    <span style="color: #8482BD;">echo</span> -n <span style="color: #e57600;">"$i =&gt; "</span>
    ipmitool -H $<span style="color: #F5DA81;">i</span> -U admin -P admin chassis bootdev pxe
    ipmitool -H $<span style="color: #F5DA81;">i</span> -U admin -P admin power reset
<span style="color: #76c763;">done</span>
</pre>
</div>
</li>
<li>Check SUT boot to PXE and start installation. Installation may take more than 1 hours depend on PXE server and number of SUT<br  />
</li>
<li>Scan OS IP and save to os.ip.log after all SUT finished OS installation<br  />
</li>
<li>Copy ssh key to SUT via scp.exp<br  />
</li>
<li>Check all SUTs are booted to OS<br  />
<div class="org-src-container">

<pre class="src src-sh">pssh -t 10 -i -h os.ip.log <span style="color: #e57600;">'uname -a'</span>
</pre>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Prepare before test</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> PXE server</h3>
<div class="outline-text-3" id="text-4-1">
<ol class="org-ol">
<li>Copy all tools and scripts to a folder: /root/logs<br  />
</li>
<li>Edit /etc/exports to include this folder:<br  />
<div class="org-src-container">

<pre class="src src-sh">/root/logs *(rw,no_root_squash,insecure)
</pre>
</div>
</li>
<li>Start/Restart nfs server<br  />
<div class="org-src-container">

<pre class="src src-sh">service nfs restart
</pre>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> SUT</h3>
<div class="outline-text-3" id="text-4-2">
<ol class="org-ol">
<li>Mount this nfs share folder for each SUT<br  />
<div class="org-src-container">

<pre class="src src-sh">pssh -t 10 -i -h os.ip.log <span style="color: #e57600;">'mount -t nfs 192.168.0.1:/root/logs /tmp/log'</span>
</pre>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Run stress</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Run performance</h3>
<div class="outline-text-3" id="text-5-1">
<ol class="org-ol">
<li>Start performance<br  />
<div class="org-src-container">

<pre class="src src-sh">pssh -t 10 -i -h os.ip.log <span style="color: #e57600;">'nohup &amp;&gt;out.txt bash /tmp/log/perf.sh &amp;'</span>
</pre>
</div>
</li>
<li>Check performance done<br  />
<ul class="org-ul">
<li>It takes about half an hour<br  />
</li>
<li>HDD LED will stop blink when done<br  />
</li>
<li>no fio running:<br  />
<div class="org-src-container">

<pre class="src src-sh">pssh -t 10 -i -h os.ip.log <span style="color: #e57600;">'ps ax|grep fio'</span>
</pre>
</div>
</li>
</ul>
</li>
<li>Collect performance logs<br  />
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #8482BD;">cd</span> /tmp/log/
zip -r $(date +<span style="color: #e57600;">"%Y-%m%d-%H%M%S"</span>)-perf.zip 4F*/perf/*.log
</pre>
</div>
</li>
<li>Check performance logs<br  />
<div class="org-src-container">

<pre class="src src-sh">bash check-all.sh 
bash check-all.sh &gt; $(date +<span style="color: #e57600;">"%Y-%m%d-%H%M%S"</span>)-perf-fail.log 
rm -fr 4F*
</pre>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Run stress</h3>
<div class="outline-text-3" id="text-5-2">
<ol class="org-ol">
<li>Start stress<br  />
<div class="org-src-container">

<pre class="src src-sh">pssh -t 10 -i -h os.ip.log <span style="color: #e57600;">'nohup &amp;&gt;out.txt bash /tmp/log/stress.sh &amp;'</span>
</pre>
</div>
</li>
<li>Stop stress<br  />
<div class="org-src-container">

<pre class="src src-sh">pssh -t 10 -i -h os.ip.log <span style="color: #e57600;">'killall ptu'</span> 
pssh -t 10 -i -h os.ip.log <span style="color: #e57600;">'killall bash'</span> 
pssh -t 10 -i -h os.ip.log <span style="color: #e57600;">'killall stream'</span> 
pssh -t 10 -i -h os.ip.log <span style="color: #e57600;">'killall fio'</span> 
pssh -t 10 -i -h os.ip.log <span style="color: #e57600;">'ps ax|grep ptu'</span> 
pssh -t 10 -i -h os.ip.log <span style="color: #e57600;">'ps ax|grep stream'</span> 
pssh -t 10 -i -h os.ip.log <span style="color: #e57600;">'ps ax|grep fio'</span>
</pre>
</div>
</li>
<li>Collect stress logs<br  />
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #8482BD;">cd</span> /tmp/log/
zip -r $(date +<span style="color: #e57600;">"%Y-%m%d-%H%M%S"</span>)-stress.zip 4F*/*/*.log
</pre>
</div>
</li>
<li>Check stress logs<br  />
<div class="org-src-container">

<pre class="src src-sh">bash check-all.sh 
bash check-all.sh &gt; $(date +<span style="color: #e57600;">"%Y-%m%d-%H%M%S"</span>)-stress-fail.log 
rm -fr 4F*
</pre>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Run performance again</h3>
<div class="outline-text-3" id="text-5-3">
<ol class="org-ol">
<li>Start performance<br  />
</li>
<li>Check performance done<br  />
</li>
<li>Collect performance logs<br  />
</li>
<li>Check performance logs<br  />
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Run DC</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Start DC</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">

<pre class="src src-sh">pssh -t 10 -i -h os.ip.log <span style="color: #e57600;">'nohup &amp;&gt;out.txt bash /tmp/log/dc.sh &amp;'</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Stop DC</h3>
<div class="outline-text-3" id="text-6-2">
<ol class="org-ol">
<li>Connect your notebook to the network and put a stop file on ftp server.<br  />
</li>
<li>Collect DC logs<br  />
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #8482BD;">cd</span> /tmp/log/
zip -r $(date +<span style="color: #e57600;">"%Y-%m%d-%H%M%S"</span>)-dc.zip 4F*/*/*.log
</pre>
</div>
</li>
<li>Check DC logs<br  />
<div class="org-src-container">

<pre class="src src-sh">bash check-all.sh 
bash check-all.sh &gt; $(date +<span style="color: #e57600;">"%Y-%m%d-%H%M%S"</span>)-dc-fail.log 
rm -fr 4F*
</pre>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Run reboot</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Start reboot</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">

<pre class="src src-sh">pssh -t 10 -i -h os.ip.log <span style="color: #e57600;">'nohup &amp;&gt;out.txt bash /tmp/log/reboot.sh &amp;'</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> Stop reboot</h3>
<div class="outline-text-3" id="text-7-2">
<ol class="org-ol">
<li>Connect your notebook to the network and put a stop file on ftp server.<br  />
</li>
<li>Collect reboot logs<br  />
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #8482BD;">cd</span> /tmp/log/
zip -r $(date +<span style="color: #e57600;">"%Y-%m%d-%H%M%S"</span>)-reboot.zip 4F*/*/*.log
</pre>
</div>
</li>
<li>Check reboot logs<br  />
<div class="org-src-container">

<pre class="src src-sh">bash check-all.sh 
bash check-all.sh &gt; $(date +<span style="color: #e57600;">"%Y-%m%d-%H%M%S"</span>)-reboot-fail.log 
rm -fr 4F*
</pre>
</div>
</li>
</ol>

<hr  />
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2014/1/17</p>
<p class="author">Author: Zhang Bin-jie</p>
<p class="date">Created: 2014-01-23 Thu 17:00</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.1.1)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
